"""
덧셈
"""

"""
숫자 덧셈
"""
result = 5 + 3
print(result)  # 8
result = 3 + 2.5
print(result)  # 5.5

"""
문자열 덧셈
"""
s1 = "hello"
s2 = "world"
result = s1 + s2
print(result)  # helloworld

"""
리스트와 튜플의 덧셈
"""
list1 = [1, 2, 3]
list2 = [4, 5, 6]
combined_list = list1 + list2
print(combined_list)  # [1, 2, 3, 4, 5, 6]

tuple1 = (1, 2, 3)
tuple2 = (4, 5, 6)
combined_tuple = tuple1 + tuple2
print(combined_tuple)  # (1, 2, 3, 4, 5, 6)

########################################################################################################################
"""
뺼셈
"""

"""
숫자 뺄셈
"""
result = 7 - 4
print(result)  # 3
result = 7 - 4.0
print(result)  # 3.0
result = 7 - (-4.0)
print(result)  # 11.0

"""
셋의 뺼셈 -> 차집합
셋의 덧셈 -> 불가능
"""
set1 = {1, 2, 3}
set2 = {2}
print(set1 - set2)  # {1, 3}

########################################################################################################################
"""
곱셈
"""

"""
숫자 곱셈
"""
result = 2 * 5
print(result)  # 10
result = 2 * 5.0
print(result)  # 10.0

"""
문자열 곱셈
"""
result = "zzz" * 3
print(result)  # zzzzzzzzz

"""
리스트 * 정수 -> 가능
리스트 * 실수, 리스트 * 리스트 -> 불가능
"""
result = [1, 2, 3] * 3
print(result)  # [1, 2, 3, 1, 2, 3, 1, 2, 3]

########################################################################################################################
"""
나눗셈
/ -> float
// -> int (내림)
"""
a = 5
b = 2
print(a / b)  # 2.5
print(a // b)  # 2
a = 5
b = -2
print(a / b)  # -2.5
print(a // b)  # -3

########################################################################################################################
"""
나머지 연산
"""
result = 10 % 3
print(result)  # 1

print(10 % 2 == 0)  # True
print(15 % 2 == 0)  # False



